

import 'package:get/get.dart';

///字符串常量管理
class StringStyles {
  static const String appName = 'appName';
  static const String loading = '加载中';
  static const String enter = "确认";
  static const String quit = "取消";

  static const Map<String, String> complainAQMap = {
    "为什么我会连续中奖或不中奖？": "首先连续多次不中奖的是小概率事件，其次中奖与不中奖是随机事件，随机事件的发生的频率会趋于一个稳定值。 在非迭代的情况下，事物出现的概率对每个人来讲是相等的，这个情况下，每个人都是公平的。 同时随机事件会遵大数定律（在试验不变的条件下，重复试验多次，随机事件的频率近似于它的概率大数定律定义），在转账频次不断增加的情况下，中奖与不中奖的概率会趋于一个稳定值。 所以请您继续转账，随着转账频次增加则中奖总概率会提升。",
    "如何反馈相关诉求？": "您好，您对我司服务有更好的建议或想提供宝贵的意见，欢迎随时与我们线上留言或我司热线，我们将尽快与您联系，竭诚为您服务。",
    "为什么会延迟到帐？": "全球有许多知名公链都支持进行USDT转账，而我们平台是基于波场TRC20技术。 所以我们平台的转账地址是属于USDT-TRC20， 您应该选择USDT-TRC20； 如果您选择了其他类型，幸运哈希则无法收到您的USDT，这会造成您和幸运哈希双方的损失。",
    "中心化钱包？去中心化钱包？为什么中心化钱包无法查询转账？": "举一个例子：您自己的钱包地址是A，您给地址E转入10个USDT，但您用交易哈希值去查询，只能查询到服务商随机某个账本地址B（或C或D等等）与E的转账。 同理E也无法得知这10个USDT是否是您转出的，因为E只能看见是账本地址B给他转入10个USDT。这就是为什么中心化钱包无法在区块链上查询真实转账信息。",
    "为什么我经常收不到推送消息？": "您可以在工作日时间联系您的专属服务人员/助理申请修改。"
  };
}
